; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v1 - type_3 ?v5 - type_1)
 	      (pred_4 ?v2 - object ?v5 - type_1)
	      (pred_1 ?v1 - type_3 ?v6 - type_2)
	      (pred_2 ?v1 - type_3 ?v2 - object ?v6 - type_2))

   (:action op_2
       :parameters  (?v1 - type_3 ?v4 ?v7 - type_1)
       :precondition (and  (pred_3 ?v1 ?v4))
       :effect (and  (pred_3 ?v1 ?v7)
		     (not (pred_3 ?v1 ?v4))))

   (:action op_3
       :parameters (?v1 - type_3 ?v3 - object ?v8 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_4 ?v3 ?v8) (pred_3 ?v1 ?v8) (pred_1 ?v1 ?v6))
       :effect (and (pred_2 ?v1 ?v3 ?v6)
		    (not (pred_4 ?v3 ?v8)) 
		    (not (pred_1 ?v1 ?v6))))

   (:action op_1
       :parameters (?v1 - type_3 ?v3 - object ?v8 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_2 ?v1 ?v3 ?v6) (pred_3 ?v1 ?v8))
       :effect (and (pred_4 ?v3 ?v8)
		    (pred_1 ?v1 ?v6)
		    (not (pred_2 ?v1 ?v3 ?v6)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_08 obj_11 - type_3
obj_07 obj_10 obj_02 obj_13 - type_2
obj_03 obj_05 obj_09 obj_01 - type_1
obj_12 obj_04 obj_06 - object)
(:init
(pred_3 obj_08 obj_01)
(pred_1 obj_08 obj_07)
(pred_1 obj_08 obj_10)
(pred_3 obj_11 obj_03)
(pred_1 obj_11 obj_02)
(pred_1 obj_11 obj_13)
(pred_4 obj_12 obj_03)
(pred_4 obj_04 obj_05)
(pred_4 obj_06 obj_09)
)
(:goal
(and
(pred_4 obj_12 obj_09)
(pred_4 obj_04 obj_05)
(pred_4 obj_06 obj_05)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_08 obj_09) (pred_3 obj_11 obj_09))))
  )
)
)

; plan
1. (op_3 obj_11 obj_12 obj_03 obj_13)
   deleted: (pred_4 obj_12 obj_03) (pred_1 obj_11 obj_13)
   added: (pred_2 obj_11 obj_12 obj_13)
   goals met: 1 of 3
2. (op_2 obj_08 obj_01 obj_05)
   deleted: (pred_3 obj_08 obj_01)
   added: (pred_3 obj_08 obj_05)
   goals met: 1 of 3
3. (op_2 obj_11 obj_03 obj_09)
   deleted: (pred_3 obj_11 obj_03)
   added: (pred_3 obj_11 obj_09)
   goals met: 1 of 3
4. (op_1 obj_11 obj_12 obj_09 obj_13)
   deleted: (pred_2 obj_11 obj_12 obj_13)
   added: (pred_4 obj_12 obj_09) (pred_1 obj_11 obj_13)
   goals met: 2 of 3
5. (op_3 obj_11 obj_06 obj_09 obj_02)
   deleted: (pred_4 obj_06 obj_09) (pred_1 obj_11 obj_02)
   added: (pred_2 obj_11 obj_06 obj_02)
   goals met: 2 of 3
6. (op_2 obj_11 obj_09 obj_05)
   deleted: (pred_3 obj_11 obj_09)
   added: (pred_3 obj_11 obj_05)
   goals met: 2 of 3
7. (op_1 obj_11 obj_06 obj_05 obj_02)
   deleted: (pred_2 obj_11 obj_06 obj_02)
   added: (pred_4 obj_06 obj_05) (pred_1 obj_11 obj_02)
   goals met: 3 of 3
